Revit 2027 API
BuiltInFailures.ElectricalFailures.UnsignedCircuit Property
 Circuit is not assigned to a panel
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnsignedCircuit { get; }
Public Shared ReadOnly Property UnsignedCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnsignedCircuit {
	FailureDefinitionId^ get ();
}
static member UnsignedCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace